content/posts/sun2020.md
+++
title = "sun2020 | Dual quaternion based dynamics modeling for electromagnetic collocated satellites of diffraction imaging on geostationary orbit"
author = ["João Gutemberg Farias"]
draft = false
+++

tags
: [Dual Quaternions Applications]({{< relref "dual_quaternions_applications" >}})

Uses dual quaternions to model an eletromagnetic force with applications in satellites. Also derives the dynamics equations of the satellites subject to this force.


## Info {#info}

This paper proposes an innovated approach to model an electromagnetic force which is an ideal control force without plume and light pollution for optical imaging system. The main scope is modeling the 3-axis coupled electromagnetic force using dual quaternion for its advantages in describing spiral motion with translation and rotation motion simultaneously. The derivation procedure relies on a far field model of the electromagnetic force, and also, the force is re-formulized. Final equations show the dual quaternion dynamics can express the relative motion caused by the electromagnetic force acting on the position and attitude integrally. A new mission concept of diffraction imaging system in GEO is discussed as application scenario of the new dynamics model. Two cases with different mass were simulated to verify the new model, and the results display the electromagnetic force is significant for a small mass spacecraft in GEO.


## Notes {#notes}


### Resumo {#resumo}

Não li muito porque foge um pouco da minha área, mas o interessante é que usa quatérnios duais para modelar uma força eletromagnética.
